api2/app/controllers/users_controller.rb

    def create
      @user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def index
      @payload = User.all
      @users = []

      @payload.map{|user| (
        p = 'no-img.jpeg'
        if (user.photo.persisted?)
          p = url_for(user.photo)
        end
        @users << {:id => user.id, :name => user.name, :email => user.email, :created_at => user.created_at.strftime("%d/%m/%Y"), :photo => p}
      )}
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "matheuscatalan@outlook.com"], ["LIMIT", 1]]

    def update
      @user = User.find(@user.id)
      if params[:photo] == 'null'
        @user.update(name: params[:name], email: params[:email])

        render json: {
          name: @user.name,
          email: @user.email
        }, status: 200
      else
        @user.update(name: params[:name], email: params[:email], photo: params[:photo])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "elinore.goodwin@yahoo.com"], ["updated_at", "2021-05-02 23:44:26.495480"], ["id", 3]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "anabel_erdman@gmail.com"], ["updated_at", "2021-05-03 13:31:32.224584"], ["id", 7]]

    def delete
      User.find(params[:userId]).destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def login
      @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Elinore.Goodwin@yahoo.com"], ["LIMIT", 1]]

    def forgotPassword
      @user = User.find_by(email: params[:email])
      token = SecureRandom.hex(4)
      @user.update(token_forgot_password: token, date_forgot_password: Date.current)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "anabel_erdman@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "token_forgot_password" = $2, "date_forgot_password" = $3 WHERE "users"."id" = $4  [["updated_at", "2021-05-03 14:14:34.403759"], ["token_forgot_password", "f7ee93f7"], ["date_forgot_password", "2021-05-03"], ["id", 7]]

    def forgotPasswordSave
      @user = User.find_by(token_forgot_password: params[:tokenForgotPassword])
      print @user.name

      @user.update(token_forgot_password: nil, date_forgot_password: nil, password: params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."token_forgot_password" = $1 LIMIT $2  [["token_forgot_password", "e6d9903c"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2, "token_forgot_password" = $3, "date_forgot_password" = $4 WHERE "users"."id" = $5