api2/app/controllers/users_controller.rb

    def forgotPassword
      @user = User.find_by(email: params[:email])
      token = SecureRandom.hex(4)
      @user.update(token_forgot_password: token, date_forgot_password: Date.current)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "matheuscatalan@outlook.com"], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Matheus Catalan r"], ["updated_at", "2021-05-01 16:14:07.124963"], ["id", 1]]

    def forgotPasswordSave
      print '---------------------------------------------------------------------------------'
      print params
      print '---------------------------------------------------------------------------------'

      @user = User.find_by(token_forgot_password: params[:tokenForgotPassword])
---
SELECT "users".* FROM "users" WHERE "users"."token_forgot_password" = $1 LIMIT $2  [["token_forgot_password", "d81cca21"], ["LIMIT", 1]]